tests/fixtures/allegro/checkout-forms-list.json

{
  "checkoutForms": [
    {
      "id": "6282fec0-75f7-11f1-b8b6-9d2856530dfe",
      "messageToSeller": null,
      "buyer": {
        "id": "53252673",
        "email": "buyer@allegromail.pl",
        "login": "Client:53252673",
        "firstName": "TEST",
        "lastName": "Buyer",
        "companyName": null,
        "guest": false,
        "personalIdentity": null,
        "phoneNumber": "+48000000000",
        "preferences": {
          "language": "pl-PL"
        },
        "address": {
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "postCode": "00-000",
          "countryCode": "PL"
        }
      },
      "payment": {
        "id": "62e51c38-75f7-11f1-b68e-775012317e0d",
        "type": "ONLINE",
        "provider": "AF",
        "finishedAt": "2026-07-02T09:22:33.135Z",
        "paidAmount": {
          "amount": "158.00",
          "currency": "PLN"
        },
        "reconciliation": null,
        "features": []
      },
      "status": "READY_FOR_PROCESSING",
      "fulfillment": {
        "status": "NEW",
        "shipmentSummary": {
          "lineItemsSent": "NONE"
        },
        "provider": {
          "id": "SELLER"
        }
      },
      "delivery": {
        "address": {
          "firstName": "TEST",
          "lastName": "Buyer",
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "zipCode": "00-000",
          "countryCode": "PL",
          "companyName": null,
          "phoneNumber": "+48000000000",
          "modifiedAt": null
        },
        "method": {
          "id": "0b257488-c85d-4507-b967-9b45ffbfa2e8",
          "name": "Allegro One Box, DPD"
        },
        "pickupPoint": {
          "id": "AL012ESI",
          "name": "Allegro One Box - AL012ESI",
          "description": "Obok siłowni \"Studio Relaks\"",
          "address": {
            "street": "ul. Testowa 1",
            "zipCode": "00-000",
            "city": "Warszawa",
            "countryCode": "PL"
          }
        },
        "cost": {
          "amount": "0.00",
          "currency": "PLN"
        },
        "smart": true,
        "time": {
          "from": "2026-07-03T22:00:00Z",
          "to": "2026-07-04T21:59:59.999Z",
          "guaranteed": null,
          "dispatch": {
            "from": "2026-07-02T22:00:00Z",
            "to": "2026-07-03T21:59:59.999Z"
          }
        },
        "calculatedNumberOfPackages": 1,
        "cancellation": null
      },
      "invoice": {
        "required": false,
        "address": null,
        "dueDate": null,
        "features": null
      },
      "lineItems": [
        {
          "id": "627c4800-75f7-11f1-b8b6-9d2856530dfe",
          "offer": {
            "id": "17613428785",
            "name": "HUMIO - Alkaliczna Woda Humusowa 500ml x 12",
            "external": {
              "id": "PET"
            },
            "productSet": null,
            "hsNumber": null
          },
          "quantity": 2,
          "originalPrice": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "price": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "reconciliation": null,
          "selectedAdditionalServices": [],
          "vouchers": [],
          "tax": {
            "rate": "8.00",
            "subject": "GOODS",
            "exemption": null
          },
          "boughtAt": "2026-07-02T09:22:17.087Z",
          "discounts": null,
          "deposit": {
            "price": {
              "amount": "6.00",
              "currency": "PLN"
            }
          },
          "serialNumbers": {
            "expected": false,
            "entries": []
          }
        }
      ],
      "surcharges": [],
      "note": null,
      "marketplace": {
        "id": "allegro-pl"
      },
      "summary": {
        "totalToPay": {
          "amount": "158.00",
          "currency": "PLN"
        }
      },
      "updatedAt": "2026-07-02T09:22:33.135Z",
      "revision": "3294a91d"
    },
    {
      "id": "51f30b80-7567-11f1-a310-e58c9e10bb58",
      "messageToSeller": null,
      "buyer": {
        "id": "34685383",
        "email": "buyer@allegromail.pl",
        "login": "Client:34685383",
        "firstName": "TEST",
        "lastName": "Buyer",
        "companyName": null,
        "guest": false,
        "personalIdentity": null,
        "phoneNumber": "+48000000000",
        "preferences": {
          "language": "pl-PL"
        },
        "address": {
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "postCode": "00-000",
          "countryCode": "PL"
        }
      },
      "payment": {
        "id": "79668886-7567-11f1-9fcc-4baf0ec18bad",
        "type": "ONLINE",
        "provider": "AF",
        "finishedAt": "2026-07-01T16:11:51.618Z",
        "paidAmount": {
          "amount": "158.00",
          "currency": "PLN"
        },
        "reconciliation": null,
        "features": []
      },
      "status": "READY_FOR_PROCESSING",
      "fulfillment": {
        "status": "READY_FOR_SHIPMENT",
        "shipmentSummary": {
          "lineItemsSent": "ALL"
        },
        "provider": {
          "id": "SELLER"
        }
      },
      "delivery": {
        "address": {
          "firstName": "TEST",
          "lastName": "Buyer",
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "zipCode": "00-000",
          "countryCode": "PL",
          "companyName": "Coaching Szkolenia",
          "phoneNumber": "+48000000000",
          "modifiedAt": null
        },
        "method": {
          "id": "2488f7b7-5d1c-4d65-b85c-4cbcf253fd93",
          "name": "Allegro Paczkomaty InPost"
        },
        "pickupPoint": {
          "id": "GRN01BAPP",
          "name": "Paczkomat GRN01BAPP",
          "description": "Market Dino",
          "address": {
            "street": "ul. Testowa 1",
            "zipCode": "00-000",
            "city": "Warszawa",
            "countryCode": "PL"
          }
        },
        "cost": {
          "amount": "0.00",
          "currency": "PLN"
        },
        "smart": true,
        "time": {
          "from": "2026-07-02T22:00:00Z",
          "to": "2026-07-03T21:59:59.999Z",
          "guaranteed": null,
          "dispatch": {
            "from": "2026-07-01T22:00:00Z",
            "to": "2026-07-02T21:59:59.999Z"
          }
        },
        "calculatedNumberOfPackages": 1,
        "cancellation": null
      },
      "invoice": {
        "required": false,
        "address": null,
        "dueDate": null,
        "features": null
      },
      "lineItems": [
        {
          "id": "51eb6a60-7567-11f1-a310-e58c9e10bb58",
          "offer": {
            "id": "17613428785",
            "name": "HUMIO - Alkaliczna Woda Humusowa 500ml x 12",
            "external": {
              "id": "PET"
            },
            "productSet": null,
            "hsNumber": null
          },
          "quantity": 2,
          "originalPrice": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "price": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "reconciliation": null,
          "selectedAdditionalServices": [],
          "vouchers": [],
          "tax": {
            "rate": "8.00",
            "subject": "GOODS",
            "exemption": null
          },
          "boughtAt": "2026-07-01T16:11:34.990Z",
          "discounts": null,
          "deposit": {
            "price": {
              "amount": "6.00",
              "currency": "PLN"
            }
          },
          "serialNumbers": {
            "expected": false,
            "entries": []
          }
        }
      ],
      "surcharges": [],
      "note": null,
      "marketplace": {
        "id": "allegro-pl"
      },
      "summary": {
        "totalToPay": {
          "amount": "158.00",
          "currency": "PLN"
        }
      },
      "updatedAt": "2026-07-01T16:11:51.618Z",
      "revision": "3294a91d"
    },
    {
      "id": "592e64a0-72d1-11f1-aea2-cb14c532efdc",
      "messageToSeller": null,
      "buyer": {
        "id": "000000000",
        "email": "buyer@allegromail.pl",
        "login": "Client:102510974",
        "firstName": "TEST",
        "lastName": "Buyer",
        "companyName": null,
        "guest": false,
        "personalIdentity": null,
        "phoneNumber": "+48000000000",
        "preferences": {
          "language": "pl-PL"
        },
        "address": {
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "postCode": "00-000",
          "countryCode": "PL"
        }
      },
      "payment": {
        "id": "5977555d-72d1-11f1-b68e-775012317e0d",
        "type": "ONLINE",
        "provider": "AF",
        "finishedAt": "2026-06-28T09:12:46.558Z",
        "paidAmount": {
          "amount": "168.49",
          "currency": "PLN"
        },
        "reconciliation": null,
        "features": []
      },
      "status": "READY_FOR_PROCESSING",
      "fulfillment": {
        "status": "PICKED_UP",
        "shipmentSummary": {
          "lineItemsSent": "ALL"
        },
        "provider": {
          "id": "SELLER"
        }
      },
      "delivery": {
        "address": {
          "firstName": "TEST",
          "lastName": "Buyer",
          "street": "ul. Testowa 1",
          "city": "Warszawa",
          "zipCode": "00-000",
          "countryCode": "PL",
          "companyName": null,
          "phoneNumber": "+48000000000",
          "modifiedAt": null
        },
        "method": {
          "id": "09164667-daa5-42dc-8087-33d7485790ac",
          "name": "Allegro Automat ORLEN Paczka"
        },
        "pickupPoint": {
          "id": "159560",
          "name": "Automat ORLEN Paczka",
          "description": "Automat paczkowy na parkingu przy lokalu usługowym",
          "address": {
            "street": "ul. Testowa 1",
            "zipCode": "00-000",
            "city": "Warszawa",
            "countryCode": "PL"
          }
        },
        "cost": {
          "amount": "10.49",
          "currency": "PLN"
        },
        "smart": false,
        "time": {
          "from": "2026-06-30T22:00:00Z",
          "to": "2026-07-01T21:59:59.999Z",
          "guaranteed": null,
          "dispatch": {
            "from": "2026-06-29T22:00:00Z",
            "to": "2026-06-30T21:59:59.999Z"
          }
        },
        "calculatedNumberOfPackages": 1,
        "cancellation": null
      },
      "invoice": {
        "required": false,
        "address": null,
        "dueDate": null,
        "features": null
      },
      "lineItems": [
        {
          "id": "59293480-72d1-11f1-aea2-cb14c532efdc",
          "offer": {
            "id": "17613428785",
            "name": "HUMIO - Alkaliczna Woda Humusowa 500ml x 12",
            "external": {
              "id": "PET"
            },
            "productSet": null,
            "hsNumber": null
          },
          "quantity": 2,
          "originalPrice": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "price": {
            "amount": "73.00",
            "currency": "PLN"
          },
          "reconciliation": null,
          "selectedAdditionalServices": [],
          "vouchers": [],
          "tax": {
            "rate": "8.00",
            "subject": "GOODS",
            "exemption": null
          },
          "boughtAt": "2026-06-28T09:12:25.670Z",
          "discounts": null,
          "deposit": {
            "price": {
              "amount": "6.00",
              "currency": "PLN"
            }
          },
          "serialNumbers": {
            "expected": false,
            "entries": []
          }
        }
      ],
      "surcharges": [],
      "note": null,
      "marketplace": {
        "id": "allegro-pl"
      },
      "summary": {
        "totalToPay": {
          "amount": "168.49",
          "currency": "PLN"
        }
      },
      "updatedAt": "2026-06-28T09:12:46.558Z",
      "revision": "3294a91d"
    }
  ],
  "count": 3,
  "totalCount": 72
}
